---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarContainerItem.GetPresentationMode(Autodesk.Revit.DB.View)
source: html/738e3080-7657-2dc7-6dd4-5827c9ea718d.htm
---
# Autodesk.Revit.DB.Structure.RebarContainerItem.GetPresentationMode Method

Gets the presentaion mode for this rebar set when displayed in the given view.

## Syntax (C#)
```csharp
public RebarPresentationMode GetPresentationMode(
	View dBView
)
```

## Parameters
- **dBView** (`Autodesk.Revit.DB.View`) - The view.

## Returns
The presentation mode.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null